In [1]:
import pandas as pd 
import numpy as np

In [2]:
#createing a data frame using a dictionary 
d = {"a":[1,2,np.nan],"b":[5, np.nan, np.nan],"c":[1,2,3]}

In [3]:
df = pd.DataFrame(d)

In [4]:
df

     a    b  c
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [7]:
#drop rows that have missing values 
df.dropna()

     a    b  c
0  1.0  5.0  1

In [6]:
df

     a    b  c
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [9]:
#setting threshold on dropping na - this sets a limit to how many na values you are willig
#to accept before dropping 
#this will keep row 1 since there is only one missing value
df.dropna(thresh=2)

     a    b  c
0  1.0  5.0  1
1  2.0  NaN  2

In [10]:
#filling na items in a  data set
df

     a    b  c
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [15]:
df["a"].fillna(value = df["a"].mean(), inplace = True)
df["b"].fillna(value = df["b"].mean(), inplace = True)

In [16]:
df

     a    b  c
0  1.0  5.0  1
1  2.0  5.0  2
2  1.5  5.0  3